{
  "title": "Introduction to Sales",
  "introduction": "This module introduces the fundamental concepts of sales, its importance in business, and the strategic role it plays in marketing. Sales is the process of persuading potential customers to purchase a product or service through an exchange of money for goods or services.",
  "sections": [
    {
      "id": "what-is-sales",
      "title": "What is Sales?",
      "content": [
        {
          "type": "text",
          "value": "Sales is the exchange of money for goods or services."
        },
        {
          "type": "example",
          "value": "Example: A mobile phone is selling at the local store."
        }
      ]
    },
    {
      "id": "definition-of-marketing",
      "title": "Definition of Marketing",
      "content": [
        {
          "type": "text",
          "value": "Marketing is the way businesses tell people about their products and make them want to buy. It includes advertisements, promotions, and other strategic communication to attract customers."
        },
        {
          "type": "example",
          "value": "Example: A mobile phone advertisement on TV, newspapers, or radio."
        }
      ]
    },
    {
      "id": "sales-in-marketing",
      "title": "Sales in Marketing",
      "content": [
        {
          "type": "text",
          "value": "Sales marketing refers to the strategic approach and activities used by businesses to promote products or services. It involves generating leads and driving revenue through various sales channels."
        },
        {
          "type": "list",
          "items": [
            "Sales involves identifying potential customers from the leads, interacting with them and closing deals.",
            "Sales can take place in person or over the phone or online.",
            "Sales can involve offering discounts, explaining the benefits of the product."
          ]
        }
      ]
    },
    {
      "id": "b2b-vs-b2c",
      "title": "B2B vs. B2C Sales",
      "content": [
        {
          "type": "text",
          "value": "Sales can be categorized based on the customer type:"
        },
        {
          "type": "list",
          "items": [
            "B2B (Business to Business): A business sells products or services to another business. (Example: Apple selling its products to retail shops.)",
            "B2C (Business to Consumer): A business sells products or services directly to individual customers. (Example: Retail shops selling a mobile phone to individuals.)"
          ]
        },
        {
          "type": "text",
          "value": "The sales cycle in B2B is typically longer and requires multiple approvals, whereas B2C sales tend to have a shorter cycle."
        }
      ]
    },
    {
      "id": "role-of-salesperson",
      "title": "Role of a Salesperson",
      "content": [
        {
          "type": "list",
          "items": [
            "Practicing active listening",
            "Finding an emotional connection",
            "Understanding the product",
            "Having excellent interpersonal skills",
            "Approaching sales as a service",
            "Being likeable and trustworthy",
            "Being honest and trustworthy",
            "Building trust by asking questions"
          ]
        }
      ]
    }
  ],
  "source": "Merged from 00 Introduction to Sales.pdf and introduction.json"
}
