[
    {
      "level": "Beginner",
      "exercises": [
        {
          "id": 1,
          "title": "Simple Greeting",
          "question": "What greeting does the speaker use?",
          "transcript": "Hello, how are you today?",
          "sampleAnswer": "Hello, how are you today?"
        },
        {
          "id": 2,
          "title": "Digital Literacy",
          "question": "Why is digital literacy important in today's society?",
          "transcript": "Digital literacy has become a fundamental requirement for full participation in modern society. Beyond basic computer skills, it encompasses the ability to find, evaluate, and create information using digital technology.",
          "sampleAnswer": "Digital literacy is important for participation in modern society. It includes finding, evaluating, and creating information using digital technology."
        }
        
      ]
    },
    {
      "level": "Intermediate",
      "exercises": [
        {
          "id": 3,
          "title": "Effective Business Communication",
          "question": "What are three key elements of effective business communication?",
          "transcript": "Effective business communication is essential for success in today's fast-paced corporate environment. Three key elements that define effective business communication are clarity, conciseness, and courtesy.",
          "sampleAnswer": "Three key elements of effective business communication are clarity, conciseness, and courtesy."
        },
        {
          "id": 4,
          "title": "Time Management Strategies",
          "question": "What techniques can help professionals manage their time more effectively?",
          "transcript": "Effective time management is a critical skill in today's fast-paced professional environment. Several techniques can help professionals reclaim their time and increase productivity. The Pomodoro Technique involves working in focused 25-minute intervals followed by short breaks.",
          "sampleAnswer": "Professionals can manage time more effectively using the Pomodoro Technique, which involves focused work intervals followed by short breaks."
        }
        
      ]
    },
    {
      "level": "Advanced",
      "exercises": [
        {
          "id": 5,
          "title": "Effective Team Collaboration",
          "question": "What are the essential components of successful team collaboration?",
          "transcript": "Successful team collaboration doesn't happen by accident—it requires intentional development of specific components. Clear communication forms the foundation, with team members sharing information openly and constructively.",
          "sampleAnswer": "Successful team collaboration requires clear communication where team members share information openly and constructively."
        },
        {
          "id": 6,
          "title": "Environmental Sustainability",
          "question": "What are some ways individuals can reduce their carbon footprint?",
          "transcript": "Reducing your carbon footprint doesn't require dramatic lifestyle changes. Several practical steps can make a significant difference. Transportation choices have a major impact—consider using public transit, carpooling, cycling, or walking when possible.",
          "sampleAnswer": "Individuals can reduce their carbon footprint by using public transit, carpooling, cycling, or walking instead of driving alone."
        }
        
      ]
    }
  ]